Catalogs/Renault_КонвертацияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КонвертацияДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешниеМетаданные</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.ОбъектыМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоиска</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Comment>Осуществляет поиск без загрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнийРеквизит</Name>
							<Comment>Источник</Comment>
							<Type>
								<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.РеквизитыМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Comment>Приемник</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоПоиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Comment>Осуществляет поиск без загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Comment>Отмечаются реквизиты по которым осуществляется поиск</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_КонвертацияДанных/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РеквизитыРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	СтандартнаяОбработка=Ложь; 
	//ДанныеВыбора=Renault_ПередачаДанныхВСторонниеСистемы.СписокПредопределенныхРеквизитов(Объект.Наименование);
	СоставМетаданных=Renault_ПередачаДанныхВСторонниеСистемы.СоставМетаданных();
	ДанныеВыбора=Новый СписокЗначений;
	Для Каждого Эл Из Renault_ПередачаДанныхВСторонниеСистемы.СтруктураРеквизитовОбъектаМД(Объект.Наименование) Цикл 
		Попытка
			ИмяМД=Renault_ПередачаДанныхВСторонниеСистемы.МетаданныеИзСтроки(Renault_ПередачаДанныхВСторонниеСистемы.ОписаниеТиповВСтроку(Эл.Значение.Типы())).ПолноеИмя();
			Картинка=БиблиотекаКартинок[Лев(ИмяМД,Найти(ИмяМД,".")-1)]
		Исключение Картинка=БиблиотекаКартинок.Реквизит КонецПопытки;	
		ДанныеВыбора.Добавить(Эл.Ключ).Картинка=Картинка; 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВнешнийРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) СтандартнаяОбработка=Ложь; ДанныеВыбора=СписокВнешнихРеквизитов() КонецПроцедуры
Функция СписокВнешнихРеквизитов()
	Сп=Новый СписокЗначений;
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.РеквизитыМД ГДЕ ОбъектМД=&ОбъектМД");
	Запрос.УстановитьПараметр("ОбъектМД",Объект.ВнешниеМетаданные);
	Сп.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Для Каждого Эл Из Сп Цикл //картинки списка
		Попытка	Эл.Картинка=БиблиотекаКартинок[Лев(Эл.Значение.Тип,Найти(Эл.Значение.Тип,".")-1)]
		Исключение Эл.Картинка=БиблиотекаКартинок.Реквизит КонецПопытки 
	КонецЦикла;	
	Возврат Сп
КонецФункции

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент) Выбор_Наименование(,) КонецПроцедуры
&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.Renault_КонвертацияДанных.Форма.ПодборМД",Новый Структура("ИмяМД,ИмяРеквизитаДляПередачи",Объект.Наименование,"Наименование"),ЭтаФорма,,,,Новый ОписаниеОповещения("Выбор_Наименование",ЭтаФорма));
КонецПроцедуры
Процедура Выбор_Наименование(Значение,Параметр)
	//определим базу данных - если внешняя база всего одна (кроме собственной) то это она.
	Запрос=Новый Запрос("Выбрать Ссылка Из ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.БазыДанных ГДЕ Ссылка<>&ТекущаяБаза");
	Запрос.УстановитьПараметр("ТекущаяБаза",Renault_ПередачаДанныхВСторонниеСистемы.ТекущаяБазаДанных());
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()=1 Тогда 
		Выборка.Следующий(); 
		Объект.ВнешниеМетаданные=Справочники.Renault_КонвертацияДанных.ВнешниеМетаданныеПоНаимеменованию(Объект.Наименование,Выборка.Ссылка);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ВнешниеМетаданныеПриИзменении(Элемент) Выбор_ВнешниеМетаданные(Объект.ВнешниеМетаданные,) КонецПроцедуры
&НаКлиенте
Процедура ВнешниеМетаданныеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Структура=Новый Структура;
	Структура.Вставить("ИсключитьСобственнуюБазу",Истина);
	Структура.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("ВнешнийИсточникДанных.Renault_ПередачаДанныхВСторонниеСистемы.Таблица.ОбъектыМД.ФормаВыбора",Структура,ЭтаФорма,,,,Новый ОписаниеОповещения("Выбор_ВнешниеМетаданные",ЭтаФорма));
КонецПроцедуры
Процедура Выбор_ВнешниеМетаданные(Значение,Параметр) 
	Объект.ВнешниеМетаданные=Значение;
	Если Объект.Наименование="" Тогда
		Запрос=Новый Запрос("Выбрать Первые 1 1 ИЗ "+Объект.ВнешниеМетаданные.Имя); 
		Попытка 
			Запрос.Выполнить(); 
			Объект.Наименование=Объект.ВнешниеМетаданные.Имя;	
		Исключение КонецПопытки
	КонецЕсли
КонецПроцедуры	
Функция ПодобратьМетаданные(ИмяМД) Запрос=Новый Запрос("Выбрать Первые 1 1 ИЗ "+ИмяМД); Попытка Запрос.Выполнить(); Возврат ИмяМД Исключение Возврат "" КонецПопытки КонецФункции

&НаКлиенте
Процедура кнЗаполнитьТЧРеквизиты(Команда) ЗаполнитьТЧРеквизиты() КонецПроцедуры
Процедура ЗаполнитьТЧРеквизиты() 
	ОбъектКонвертация=РеквизитФормыВЗначение("Объект");
	Справочники.Renault_КонвертацияДанных.ЗаполнитьТЧРеквизиты(ОбъектКонвертация);
	ЗначениеВРеквизитФормы(ОбъектКонвертация,"Объект");
КонецПроцедуры

//интерфейс
&НаКлиенте
Процедура кнВкл(Команда)
	Сп=Новый СписокЗначений; 
	Сп.ЗагрузитьЗначения(Элементы.Реквизиты.ВыделенныеСтроки); 
	УстановитьФлаг(?(Команда.Имя="кнВкл",Истина,Ложь),Сп.ВыгрузитьЗначения()); 
	Элементы.Реквизиты.Обновить(); 
КонецПроцедуры
Процедура УстановитьФлаг(Флаг,Реквизиты) Для Каждого Стр Из Объект.Реквизиты Цикл Если Реквизиты.Найти(Стр.НомерСтроки-1)<>Неопределено Тогда Стр.Активно=Флаг КонецЕсли КонецЦикла КонецПроцедуры	

&НаКлиенте
Процедура кнСправка(Команда) Renault_ПередачаДанныхВСторонниеСистемы.ПоказатьСправку(ЭтаФорма,Справочники.Renault_КонвертацияДанных.ПолучитьМакет("СправкаКонвертацияДанных").ПолучитьТекст(),"Справка по составлению правил конвертации данных") КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВнешнийРеквизитПриИзменении(Элемент) ВключитьАктивность() КонецПроцедуры
&НаКлиенте
Процедура РеквизитыПравилоПриИзменении(Элемент) ВключитьАктивность() КонецПроцедуры
Процедура ВключитьАктивность()
	ТекСтрока=Элементы.Реквизиты.ТекущаяСтрока;
	ВнешнийРеквизит=Объект.Реквизиты[ТекСтрока].ВнешнийРеквизит;
	Правило=Объект.Реквизиты[ТекСтрока].Правило;
	Объект.Реквизиты[ТекСтрока].Активно=Не ВнешнийРеквизит.Пустая() Или Не Правило.Пустая();
КонецПроцедуры	

&НаКлиенте
Функция кнВыполнитьПроверку(Команда) Справочники.Renault_КонвертацияДанных.ВыполнитьПроверку(Объект) КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	Если Объект.Наименование="" Тогда Отказ=Истина; Сообщить("Поле ""Метаданные"" не заполнено",СтатусСообщения.Информация); Возврат КонецЕсли;
	Если Объект.Реквизиты.Количество()=0 Тогда
		Если Вопрос("Заполнить реквизиты метаданных?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда ЗаполнитьТЧРеквизиты() КонецЕсли
	КонецЕсли;
	Справочники.Renault_КонвертацияДанных.ВыполнитьПроверку(Объект);
КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	ТаблМД=Новый ТаблицаЗначений;
//	ТаблМД.Колонки.Добавить("ИмяРеквизита",Новый ОписаниеТипов("Строка"));
//	ТаблМД.Колонки.Добавить("ТипРеквизита",Новый ОписаниеТипов("Строка"));
//	Если Объект.Наименование<>"" Тогда
//		Для Каждого Реквизит Из Renault_ПередачаДанныхВСторонниеСистемы.СтруктураРеквизитовОбъектаМД(Объект.Наименование) Цикл
//			Стр=ТаблМД.Добавить();
//			Стр.ИмяРеквизита=Реквизит.Ключ;
//			Стр.ТипРеквизита=Renault_ПередачаДанныхВСторонниеСистемы.ОписаниеТиповВСтроку(Реквизит.Значение.Типы());
//		КонецЦикла;	
//	КонецЕсли;
//	
//КонецПроцедуры
